gdgly/NUC97X_JS/STM32F4xx/MS/Ethernet-NUC97x-linux.c
}
#endif


void Ethernet_RxTx(void)
{
 #if (IC_LAN8720|IC_IP101)==0
	u16 * p16timer;
	p16timer=(u16 *)(Get_ADDR_UARTnTimer(ENETPORT));
	if(p16timer[0]==0)
	{
	#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
			//ms->link_system("/sbin/ifconfig eth0 down");
		//OffE5V0();//关E5V0电源
	#elif RJ45SELECT==1
			//ms->link_system("/sbin/ifconfig eth1 down");
			//Off2E5V0();//关E5V0电源
	#elif RJ45SELECT==2
			//ms->link_system("/sbin/ifconfig eth0 down");
			//ms->link_system("/sbin/ifconfig eth1 down");
			//Off2E5V0();//关E5V0电源
	#endif
		p16timer[0]=5000/10;//关闭电源延时5秒
	}
 #else
	s32 i;
	s32 x;
	//u32 sourMACMIIDR;
	u8 *p8s;
	u16 * p16timer;
  UARTCtrl_TypeDef * UARTCtrl;
	u32 LEN_UARTnTx;
	u32 LEN_ADDR;
	u32 LEN_TAPDU;
	u32 LEN_TxAPDU;
	u32 LEN_Tx;
	char* p8tx;
	ms_Type * ms;
	struct sockaddr_in addr;
	u16* p16;
	u32 p0;
	int fd;
	int errno;
	
	
  UARTCtrl=(UARTCtrl_TypeDef *)(Get_ADDR_UARTnCtrl(ENETPORT));
	p16timer=(u16 *)(Get_ADDR_UARTnTimer(ENETPORT));
	
	ms=Get_ms();
	if(UARTCtrl->LinkTask<101)//101://登录ok
	{
		if(Comm_Ram->CheckLEDTimer<=(1000/10))//3000/10;//上电全部LED检查显示 每10MS减1定时器
		{
			ms->Pin_OutH(PIN_ENET_LINK_LED);//引脚输出低,入口引脚使用名
		}
	}
	
	switch(UARTCtrl->LinkTask)
	{
		case 0://0=延时关机
			if(p16timer[0]==0x0)
			{
				UARTCtrl->LinkTask++;
			#if ((DEBUG==1)&&(DEBUG_ETH==1))
					ms->link_printf("UARTCtrl->LinkTask=%d\n",UARTCtrl->LinkTask,0,0);
					ms->link_system((char*)"/sbin/ifconfig");
			#endif
			}
			return;
		case 1://1=关电源
			if(UARTCtrl->TCPSocket>=3)//进入系统时，该变量为0，为系统基本输入输出用描述符，不可用于socket通讯
			{
			#if ((DEBUG==1)&&(DEBUG_ETH==1))
					ms->link_printf("tcplink_close_socket=%d\n",UARTCtrl->TCPSocket,0,0);
					ms->link_sleep(5);
			#endif
				ms->link_close(UARTCtrl->TCPSocket);
				UARTCtrl->TCPSocket=0;
			}
			if(UARTCtrl->UDPSocket>=3)//进入系统时，该变量为0，为系统基本输入输出用描述符，不可用于socket通讯
			{
			#if ((DEBUG==1)&&(DEBUG_ETH==1))
					ms->link_printf("tcplink_close_socket=%d\n",UARTCtrl->UDPSocket,0,0);
					ms->link_sleep(5);
			#endif
				ms->link_close(UARTCtrl->UDPSocket);
				UARTCtrl->UDPSocket=0;
			}
			WarningOccur(ENETPORT,(u8 *)"重启以太网连接");//告警发生,入口告警代码和告警字符串
		
		#if MainProtocol==376
			if(Comm_Ram->TYMDHMS[2]==0)
		#endif
		#if MainProtocol==698
			if(Comm_Ram->DL698YMDHMS[2]==0)
		#endif
		#if MainProtocol==CSG
			if(Comm_Ram->RTCBuff[2]==0)
		#endif
			{//是0时,关电源
//			#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
//				//ms->link_system("/sbin/ifconfig eth0 down");
//				OffE5V0();//关E5V0电源
//			#else
//				//ms->link_system("/sbin/ifconfig eth1 down");
//				Off2E5V0();//关E5V0电源
//			#endif
				p16timer[0]=5000/10;//关闭电源延时5秒
			}
			else
			{//不是0时,不关电源
				p16timer[0]=2000/10;//延时2秒
			}
			UARTCtrl->LinkTask++;
			return;
		case 2://开电源,ETH系统初始化
			Terminal_Ram->ENETSEL=0;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
			if(Comm_Ram->POWER<3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
			{
				//本机端口号,同时用于掉电时已连接过1次识别
				if(UARTCtrl->PORT==0)
				{
					UARTCtrl->PORT=1;
				}
				else
				{
					return;//电池供电时连接1次后停止
				}
			}
			if(UARTCtrl->LinkCtrl!=1)//连接控制0=不连接,1=连接
			{
				return;
			}
			//开电源
			if(p16timer[0]!=0x0)
			{
				if(p16timer[0]<(2000/10))
				{
				#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
					if(ms->Pin_Read(PIN_ENE5V0)==0)//读引脚,入口引脚使用名;返回0或1	
					{
//						//ms->link_system("/sbin/ifconfig eth0 up");
//						OnE5V0();//打开E5V0电源
						if(p16timer[0]<(1000/10))
						{
							p16timer[0]=1000/10;//至少1s延时
						}
					}
				#else
					if(ms->Pin_Read(PIN_EN2E5V0)==0)//读引脚,入口引脚使用名;返回0或1	
					{
//						//ms->link_system("/sbin/ifconfig eth1 up");
//						On2E5V0();//打开E5V0电源
						if(p16timer[0]<(1000/10))
						{
							p16timer[0]=1000/10;//至少1s延时
						}
					}
				#endif
				}
				return;
			}
		#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
			if(ms->Pin_Read(PIN_ENE5V0)==0)//读引脚,入口引脚使用名;返回0或1	
			{
				//ms->link_system("/sbin/ifconfig eth0 up");
				//OnE5V0();//打开E5V0电源
				p16timer[0]=1000/10;//1s延时
				return;
			}
		#else
			if(ms->Pin_Read(PIN_EN2E5V0)==0)//读引脚,入口引脚使用名;返回0或1	
			{
				
				//ms->link_system("/sbin/ifconfig eth1 up");
				//On2E5V0();//打开E5V0电源
				p16timer[0]=1000/10;//1s延时
				return;
			}
		#endif
			//ETH系统初始化
#if ((DEBUG==1)&&(DEBUG_ETH==1))
		ms->link_printf("UARTCtrl->LinkTask=%d\n",UARTCtrl->LinkTask,0,0);
	#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
			ms->link_printf("/sbin/ifconfig eth0 up\n",0,0,0);
	#elif RJ45SELECT==1
			ms->link_printf("/sbin/ifconfig eth1 up\n",0,0,0);
	#elif RJ45SELECT==2
			ms->link_printf("/sbin/ifconfig eth0 up\n",0,0,0);
			ms->link_printf("/sbin/ifconfig eth1 up\n",0,0,0);
	#endif
#endif

	#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
			ms->link_system("/sbin/ifconfig eth0 up");
			//OnE5V0();//打开E5V0电源
	#elif RJ45SELECT==1
			ms->link_system("/sbin/ifconfig eth1 up");
			//On2E5V0();//打开E5V0电源
	#elif RJ45SELECT==2
			ms->link_system("/sbin/ifconfig eth0 up");
			ms->link_system("/sbin/ifconfig eth1 up");
			//On2E5V0();//打开E5V0电源
	#endif
			
			p16timer[0]=5000/10;//等待电缆RJ45插入2s延时
			Local_ASCII_IP4();//填写本地ascii ip4,出口:0=没变化,1=变化
			UARTCtrl->DHCPTask=0;//DHCP任务号
			UARTCtrl->LinkTask++;
			return;
		case 3://等待电缆RJ45插入(每2秒检测)
			if(p16timer[0]==0x0)
			{
				
#if ((DEBUG==1)&&(DEBUG_ETH==1))
		ms->link_printf("UARTCtrl->LinkTask=%d\n",UARTCtrl->LinkTask,0,0);
		ms->link_printf("cat /sys/class/net/eth0/carrier\n",UARTCtrl->LinkTask,0,0);
		ms->link_system((char*)"cat /sys/class/net/eth0/carrier");
#endif
				p16timer[0]=2000/10;//下次检测定时
				i=0;
	#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
			 fd=ms->link_open("/sys/class/net/eth0/carrier",O_RDONLY);
	#elif RJ45SELECT==1
			 fd=ms->link_open("/sys/class/net/eth1/carrier",O_RDONLY);
	#elif RJ45SELECT==2
			 fd=ms->link_open("/sys/class/net/eth0/carrier",O_RDONLY);
	#endif
        if(fd>=0)
				{
					ms->link_lseek(fd,0,SEEK_SET);
					ms->link_read(fd,&i,1);//以太网插入为'1'，没插入为'0'
				}
				ms->link_close(fd);
//				CopyString((u8 *)"标志：  ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
//				MR(ADDR_DATABUFF+6,(u32)&i,4);
//				WarningOccur(ENETPORT,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符
//			#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
//				ms->Disable_os();//暂停os
//				while (inpw(REG_EMAC0_MIIDA) & 0x20000);//MDC正忙  wait busy flag clear
//				sourMACMIIDR=inpw(REG_EMAC0_MIID);//原值保护				
//				i=Read_ETH_PHYReg(PHYAddr_IP101,1);
//				outpw(REG_EMAC0_MIID, sourMACMIIDR);//原值恢复
//				ms->Enable_os();//允许os
//			#else
//				ms->Disable_os();//暂停os
//				while (inpw(REG_EMAC1_MIIDA) & 0x20000);//MDC正忙  wait busy flag clear
//				sourMACMIIDR=inpw(REG_EMAC1_MIID);//原值保护				
//				i=Read_ETH_PHYReg(PHYAddr_LAN8720,1);
//				outpw(REG_EMAC1_MIID, sourMACMIIDR);//原值恢复
//				ms->Enable_os();//允许os
//			#endif
				//if((i&0x24)==0x24)//bit2 link is up,bit5 auto-negotiate process completed
				//if(i==0)
				if(i!='1')
				{
		#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
					x=ms->link_system("/sbin/ifconfig  eth0 | grep RUNNING");
		#elif RJ45SELECT==1
					x=ms->link_system("/sbin/ifconfig  eth1 | grep RUNNING");
		#elif RJ45SELECT==2
					x=ms->link_system("/sbin/ifconfig  eth0 | grep RUNNING");
		#endif
					if(x==0)
					{//匹配到
						i='1';
					}
				}

				if(i=='1')
				{//RJ45插入同时自动自检测完成(Link status and Auto-negotiation complete)
					if(Terminal_Ram->ENETSEL>=4)//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
					{
						WarningCancel(ENETPORT);//告警取消,入口告警代码
					}
					WarningOccur(ENETPORT,(u8 *)"以太网电缆已插入");//告警发生,入口告警代码和告警字符串
					Terminal_Ram->ENETSEL=0;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
				#if MainProtocol==376
					i=MRR(ADDR_AFN04F8,1);
				#endif
				#if MainProtocol==698
					i=MRR(ADDR_4510_2+5,1);//连接方式  enum{TCP（0），UDP（1）}
					i<<=7;
				#endif
				#if MainProtocol==CSG
					//i=MRR(ADDR_AFN04F8,1);
					i=0;
				#endif
					UARTCtrl->TCPUDP=i;
					if(Comm_Ram->Factory==0x55)
					{//工厂模式时登录不加随机延时方便工厂生产测试
						p16timer[0]=0;//5000/10;//0;//至小延时5秒,滨江新大楼发现<=3秒内不能连接
					}
					else
					{
					#if MainProtocol==376
						i=MRR(ADDR_TERMINAL,1);//终端地址的低1字节作为随机数
						i&=0x0f;
						i*=100;
						if(i<500)
						{
							i+=500;//至小延时5秒,滨江新大楼发现<=3秒内不能连接
						}
						p16timer[0]=i;
					#endif
					#if MainProtocol==698
						p16timer[0]=0;
					#endif
					#if MainProtocol==CSG
						p16timer[0]=0;
					#endif
					}
					UARTCtrl->LinkSubTask=0;//链接子任务
					UARTCtrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				}
				else
				{
					if(Terminal_Ram->ENETSEL<3)//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
					{
						Terminal_Ram->ENETSEL=3;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
					}
					else
					{//第二次判断
						if(Terminal_Ram->ENETSEL<8)//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
						{
							Terminal_Ram->ENETSEL++;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
						}
						else
						{
							UARTCtrl->LinkTask=0;
//							UARTCtrl->LinkTask++;
//							#warning "UARTCtrl->LinkTask++;"
						}
						WarningOccur(ENETPORT,(u8 *)"检测以太网电缆状态");//告警发生,入口告警代码和告警字符串
					}
				}
			}
			return;
		case 4://
		case 5://
		case 6://
			UARTCtrl->LinkTask++;
			return;
		case 7://连接随机延时1-30秒
			if(p16timer[0]==0x0)
			{
				UARTCtrl->LinkTask=99;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
#if ((DEBUG==1)&&(DEBUG_ETH==1))
		ms->link_printf("UARTCtrl->LinkTask=%d\n",UARTCtrl->LinkTask,0,0);
#endif
			}
			return;
		case 99://连接
			if (p16timer[0]!=0x0)
			{
				return;
			}
		//经实测暂停os到允许os需24us
		Terminal_Ram->ENETCheck_S_Timer=2;
//	#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
//		Disable_os();//暂停os
//		while (inpw(REG_EMAC0_MIIDA) & 0x20000)// wait busy flag clear
//		{//MDC正忙
//		}
//		sourMACMIIDR=inpw(REG_EMAC0_MIID);//原值保护
//		i=Read_ETH_PHYReg(PHYAddr_IP101,1);
//		outpw(REG_EMAC0_MIID, sourMACMIIDR);//原值恢复
//		Enable_os();//允许os
//	#else
//		Disable_os();//暂停os
//		while (inpw(REG_EMAC1_MIIDA) & 0x20000)// wait busy flag clear
//		{//MDC正忙
//		}
//		sourMACMIIDR=inpw(REG_EMAC1_MIID);//原值保护
//		i=Read_ETH_PHYReg(PHYAddr_LAN8720,1);
//		outpw(REG_EMAC1_MIID, sourMACMIIDR);//原值恢复
//		Enable_os();//允许os
//	#endif

