gdgly/NUC97X_JS/STM32F4xx/MS/Ethernet-NUC97x-linux.c
/*
		#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
				i=ms->link_system("/sbin/ifconfig  eth0 | grep RUNNING");
				//i=Read_ETH_PHYReg(PHYAddr_IP101,2);
				//if(i!=0x0243)//IP101GR
		#else
				i=ms->link_system("/sbin/ifconfig  eth1 | grep RUNNING");
		#endif
		if(i!=0)
		//if((i&(1<<2))==0)//bit2 link is up,bit5 auto-negotiate process completed
		{//RJ45拨出
			UARTCtrl->LinkTask=0;
			return;
		}
*/
		i=0;
	#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
		fd=ms->link_open("/sys/class/net/eth0/carrier",O_RDONLY);
	#elif RJ45SELECT==1
		fd=ms->link_open("/sys/class/net/eth1/carrier",O_RDONLY);
	#elif RJ45SELECT==2
		fd=ms->link_open("/sys/class/net/eth0/carrier",O_RDONLY);
	#endif
		if(fd>=0)
		{
			ms->link_lseek(fd,0,SEEK_SET);
			ms->link_read(fd,&i,1);//以太网插入为'1'，没插入为'0'
		}
		ms->link_close(fd);
		if(i!='1')
		{
#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
			x=ms->link_system("/sbin/ifconfig  eth0 | grep RUNNING");
#elif RJ45SELECT==1
			x=ms->link_system("/sbin/ifconfig  eth1 | grep RUNNING");
#elif RJ45SELECT==2
			x=ms->link_system("/sbin/ifconfig  eth0 | grep RUNNING");
#endif
			if(x==0)
			{//匹配到
				i='1';
			}
//			#warning "i='1';"
//			i='1';
		}
		if(i!='1')
		{
			UARTCtrl->LinkTask=0;
			return;
		}
	#if MainProtocol==376
		i=MRR(ADDR_AFN04F7+64,1);
		if(i==0x0)
		{//固定IP连接
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				return;
			}
		}
	#endif
	#if MainProtocol==698
		//IP配置方式enum{DHCP（0），静态（1），PPPoE（2）}
		i=MRR(ADDR_4510_4+3,1);
		if(i==1)
		{//静态（1）
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				return;
			}
		}	
	#endif
	#if MainProtocol==CSG
		i=0;//i=MRR(ADDR_AFN04F7+64,1);
		if(i==0x0)
		{//固定IP连接
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				return;
			}
		}
	#endif
			i=UARTCtrl->LinkSubTask;
			switch(i)//链接子任务
			{
				case 0://发起连接
					UARTCtrl->Task=0;//0=正在接收
					UARTCtrl->Lock=0;//0x55=通信功能正在被调用禁止其他程序再次调用
					UARTCtrl->RxByte=0;//接收字节数=0
					UARTCtrl->HostACK=0;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务
					UARTCtrl->HeartberatCount=0;//心跳发出计数,收到确认帧清0
					Terminal_Ram->ENETHeartBeat_S_Timer=0;//心跳发出秒定时器
					UARTCtrl->LinkTask2=0;//通道2链接任务(FTP命令);0-99=过程,100=建立连接
					UARTCtrl->Task2=0;//通道2任务(FTP命令)
				#if MainProtocol==698
					UARTCtrl->ReNewLink=0;//0x55=通信参数变化当前帧发送完成后重新连接
				#endif
				//ifconfig
					p8tx=(char*)ADDR_DATABUFF;
					
	#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
				p8tx=StrCopy(p8tx,"/sbin/ifconfig eth0 ");
	#elif RJ45SELECT==1
				p8tx=StrCopy(p8tx,"/sbin/ifconfig eth1 ");
			//Off2E5V0();//关E5V0电源
	#elif RJ45SELECT==2
				p8tx=StrCopy(p8tx,"/sbin/ifconfig eth0 ");
	#endif
					p8tx=StrCopy(p8tx,(char*)ADDR_IP4ADDR_ascii);
					p8tx=StrCopy(p8tx," netmask ");
					p8tx=StrCopy(p8tx,(char*)ADDR_IP4MASK_ascii);
					p8tx=StrCopy(p8tx," hw ether ");
					p8tx=StrCopy(p8tx,(char*)ADDR_MACADDR_ascii);
//					p8tx=StrCopy(p8tx," broadcast ");
//					p8tx=StrCopy(p8tx,(char*)ADDR_IP4GATEWAY_ascii);
					p8tx=StrCopy(p8tx," up ");
					p8tx[0]=0;
					p8tx=(char*)ADDR_DATABUFF;
					for(i=0;p8tx[i]!=0;i++)
					{
						if(p8tx[i]=='-')
						{
							for(x=i;p8tx[x]!=0;x++)//定义新的变量开始循环赋值 
							{
								p8tx[x]=p8tx[x+1];
								i--;
							}
						}
					}
					ms->link_system((char*)ADDR_DATABUFF);
					WarningOccur(ENETPORT,(u8 *)"配置以太网地址");//告警发生,入口告警代码和告警字符串
//					x=ms->link_open("usr/net",O_CREAT|O_RDWR);
//					if(x!=-1)
//					{
//						ms->link_write(x,(char*)ADDR_DATABUFF,i);
//						ms->link_close(x);
//					}
				//gw
//					p8tx=(char*)ADDR_DATABUFF;
//					p8tx=StrCopy(p8tx,"route add default gw ");
//					p8tx=StrCopy(p8tx,(char*)ADDR_IP4GATEWAY_ascii);
//					p8tx[0]=0;
//					
//					ms->link_system((char*)ADDR_DATABUFF);
//					p8tx=(char*)ADDR_DATABUFF;
//					for(i=0;p8tx[i]!=0;i++)
//					{
//					}
//					x=ms->link_open("usr/gw",O_CREAT|O_RDWR);
//					if(x!=-1)
//					{
//						//ms->link_lseek(x,0,SEEK_END);
//						ms->link_write(x,(char*)ADDR_DATABUFF,i);
//						ms->link_close(x);
//					}
					//本机端口号,同时用于掉电时已连接过1次识别
					UARTCtrl=(UARTCtrl_TypeDef *)(Get_ADDR_UARTnCtrl(GPRSPORT));
					x=UARTCtrl->PORT;//当前ppp拨号的PORT
					UARTCtrl=(UARTCtrl_TypeDef *)(Get_ADDR_UARTnCtrl(ENETPORT));
					i=UARTCtrl->PORT;
					if(i<SocketPortnMin)
					{
						i=SocketPortnMin;
					}
					i++;
					if(i==x)
					{
						i++;
					}
					x=MRR(ADDR_4500_2+13,2);//获取侦听端口
					x=R_Inverse(x,2);
					if(i==x)//如果和侦听端口重复，则继续加1
					{
						i++;
					}
					if((i<SocketPortnMin)||(i>SocketPortnMax))
					{
						i=SocketPortnMin;
					}
					UARTCtrl->PORT=i;
					//主站IP	
					if((UARTCtrl->TCPUDP&0x80)==0x0)
					{//TCP
						UARTCtrl->TCPSocket=ms->link_socket(AF_INET,SOCK_STREAM,0);//TCP=SOCK_STREAM ,UDP=SOCK_DGRAM
#if ((DEBUG==1)&&(DEBUG_ETH==1))
		ms->link_printf("UARTCtrl->LinkTask=%d\n",UARTCtrl->LinkTask,0,0);
		ms->link_printf("UARTCtrl->LinkSubTask=%d\n",UARTCtrl->LinkSubTask,0,0);
		ms->link_printf("eth_ms->link_socket_return/UARTCtrl->TCPSocket=%d\n",UARTCtrl->TCPSocket,0,0);
#endif
						if(UARTCtrl->TCPSocket<3)//0,1,2为系统基本输入输出用描述符，不可用于socket通讯
						{
							return;
						}
						i=ms->link_fcntl(UARTCtrl->TCPSocket,F_GETFL,0);//获取文件描述符的属性
						ms->link_fcntl(UARTCtrl->TCPSocket, F_SETFL, i | O_NONBLOCK);	//将文件描述符的属性设置为非阻塞
						
						addr.sin_family = AF_INET;// 使用 IPv4 协议
						i=UARTCtrl->PORT;
						i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
						addr.sin_port = i;//端口号:倒序
						MC(0,ADDR_IP4ADDR_ascii-1,1);
						i=IP_ASCII_HEX(ADDR_IP4ADDR_ascii-1);//ASCII转为HEX的IP;入口可为指向非ASCII数字0-9的地址;返回0表示非IP地址
						addr.sin_addr.s_addr = i;//IP地址，注:字节顺序 "192.168.0.1" = 0x0100A8C0
						i=ms->link_bind(UARTCtrl->TCPSocket,(struct sockaddr*)&addr,sizeof(struct sockaddr_in));	
#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
			CopyString((u8 *)"ETH0: ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
#elif RJ45SELECT==1
			CopyString((u8 *)"ETH1: ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
#elif RJ45SELECT==2
			CopyString((u8 *)"ETH0: ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
#endif						
				MR(ADDR_DATABUFF+6,ADDR_IP4ADDR_ascii,16);
				WarningOccur(ENETPORT,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符
#if ((DEBUG==1)&&(DEBUG_ETH==1))
    ms->link_printf("addr.sin_addr.s_addr=%x\n",addr.sin_addr.s_addr,0,0);
		ms->link_printf("addr.sin_port=%x\n",addr.sin_port,0,0);
		ms->link_printf("eth_ms->link_bind_return=%d\n",i,0,0);
#endif
						if(i!=0)
						{//调用成功时返回0，失败时返回-1
#if ((DEBUG==1)&&(DEBUG_ETH==1))
		i=ms->link_errno();
		ms->link_printf("eth_ms->link_errno_return=%d\n",i,0,0);
#endif
							UARTCtrl->LinkTask=0;
							return;
						}
						
						UARTCtrl->LinkSubTask=1;//等等TCP连接
						p16timer[0]=1000/10;
						return;
/*						
					#if MainProtocol==376
						if(UARTCtrl->LinkCount<2)
						{//主IP
							MR((u32)&addr.sin_addr.s_addr,ADDR_AFN04F3,4);
							i=MRR(ADDR_AFN04F3+4,2);
							i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
							addr.sin_port = i;//端口号:倒序
						}
						else
						{//备用IP
							MR((u32)&addr.sin_addr.s_addr,ADDR_AFN04F3+6,4);
							i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
							addr.sin_port = i;//端口号:倒序
						}
					#endif
					#if MainProtocol==698
						
						i=MRR(ADDR_4510_3+1,1);
						if((UARTCtrl->LinkCount<2)||(i<2))
						{//主IP
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,1,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								MR((u32)&addr.sin_addr.s_addr,i+2,4);
							}
							else
							{
								MWR(192+(168<<8)+(1<<16)+(3<<24),(u32)&addr.sin_addr.s_addr,4);
							}
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,2,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								i=MRR(i+1,2);
								addr.sin_port = i;//端口号:倒序
							}
							else
							{
								i=1024;
								i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
								addr.sin_port = i;//端口号:倒序
							}
						}
						else
						{//备用IP
							i=(u32)Get_Element((u8*)ADDR_4510_3,2,1,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								MR((u32)&addr.sin_addr.s_addr,i+2,4);
							}
							else
							{
								MWR(192+(168<<8)+(1<<16)+(3<<24),(u32)&addr.sin_addr.s_addr,4);
							}
							i=(u32)Get_Element((u8*)ADDR_4510_3,2,2,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								i=MRR(i+1,2);
								addr.sin_port = i;//端口号:倒序
							}
							else
							{
								i=1024;
								i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
								addr.sin_port = i;//端口号:倒序
							}
						}
					#endif
					#if MainProtocol==CSG
					
