gdgly/NUC97X_JS/STM32F4xx/MS/Ethernet-NUC97x-linux.c
//						if(UARTCtrl->LinkCount<2)
//						{//主IP
//							MR((u32)&addr->addr[0],ADDR_AFN04F3,4);
//							MR((u32)&addr->port,ADDR_AFN04F3+4,2);
//						}
//						else
//						{//备用IP
//							MR((u32)&addr->addr[0],ADDR_AFN04F3+6,4);
//							MR((u32)&addr->port,ADDR_AFN04F3+6+4,2);
//						}
					
					#endif
						
//ms->link_printf("link_connect\n",0,0,0);						
						i=ms->link_connect(UARTCtrl->TCPSocket,(struct sockaddr*)&addr,sizeof(struct sockaddr_in));
//						ms->link_printf("c%d\n",i,0,0);
						if(i==EINPROGRESS)
						{//正在连接
							i=0;
						}
						if(i!=0)
						{//调用成功时返回0，失败时返回-1
							UARTCtrl->LinkCount++;//连接计数+1
							if(UARTCtrl->LinkCount>=3)
							{
								UARTCtrl->LinkCount=0;
							}
							UARTCtrl->LinkTask=0;
							return;
						}
						WarningCancel(ENETPORT);//告警取消,入口告警代码
						p16timer[0]=0;//连接超时定时;Net_Config_TCP.h中重试定义#define TCP_MAX_RETRY 5,#define TCP_RETRY_TOUT 4;5*4=20秒
						UARTCtrl->LinkSubTask=0;//链接子任务
						UARTCtrl->LinkTask=100;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机

*/
					}
					else
					{//UDP
						UARTCtrl->UDPSocket=ms->link_socket(AF_INET,SOCK_DGRAM,0);//TCP=SOCK_STREAM ,UDP=SOCK_DGRAM
						if(UARTCtrl->UDPSocket<3)//0,1,2为系统基本输入输出用描述符，不可用于socket通讯
						{
							return;
						}
						addr.sin_family = AF_INET;// 使用 IPv4 协议
						i=UARTCtrl->PORT;
						i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
						addr.sin_port = i;//端口号:倒序
						i=IP_ASCII_HEX(ADDR_IP4ADDR_ascii);//ASCII转为HEX的IP;入口可为指向非ASCII数字0-9的地址;返回0表示非IP地址
						addr.sin_addr.s_addr = i;//IP地址，注:字节顺序 "192.168.0.1" = 0x0100A8C0
						i=ms->link_bind(UARTCtrl->TCPSocket,(struct sockaddr*)&addr,sizeof(struct sockaddr_in));
						if(i!=0)
						{//调用成功时返回0，失败时返回-1
							UARTCtrl->LinkCount++;//连接计数+1
							if(UARTCtrl->LinkCount>=3)
							{
								UARTCtrl->LinkCount=0;
							}
							UARTCtrl->LinkTask=0;
							return;
						}
						WarningCancel(ENETPORT);//告警取消,入口告警代码
						p16timer[0]=0;//连接超时定时;Net_Config_TCP.h中重试定义#define TCP_MAX_RETRY 5,#define TCP_RETRY_TOUT 4;5*4=20秒
						UARTCtrl->LinkSubTask=0;//链接子任务
						UARTCtrl->LinkTask=100;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					}
					return;
				case 1://等待TCP连接
					addr.sin_family = AF_INET;// 使用 IPv4 协议
					#if MainProtocol==376
						if(UARTCtrl->LinkCount<2)
						{//主IP
							MR((u32)&addr.sin_addr.s_addr,ADDR_AFN04F3,4);
							i=MRR(ADDR_AFN04F3+4,2);
							i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
							addr.sin_port = i;//端口号:倒序
						}
						else
						{//备用IP
							MR((u32)&addr.sin_addr.s_addr,ADDR_AFN04F3+6,4);
							i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
							addr.sin_port = i;//端口号:倒序
						}
					#endif
					#if MainProtocol==698
						i=MRR(ADDR_4510_3+1,1);
						if((UARTCtrl->LinkCount<2)||(i<2))
						{//主IP
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,1,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								MR((u32)&addr.sin_addr.s_addr,i+2,4);
							}
							else
							{
								MWR(192+(168<<8)+(1<<16)+(3<<24),(u32)&addr.sin_addr.s_addr,4);
							}
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,2,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								i=MRR(i+1,2);
								addr.sin_port = i;//端口号:倒序
							}
							else
							{
								i=1024;
								i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
								addr.sin_port = i;//端口号:倒序
							}
						}
						else
						{//备用IP
							i=(u32)Get_Element((u8*)ADDR_4510_3,2,1,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								MR((u32)&addr.sin_addr.s_addr,i+2,4);
							}
							else
							{
								MWR(192+(168<<8)+(1<<16)+(3<<24),(u32)&addr.sin_addr.s_addr,4);
							}
							i=(u32)Get_Element((u8*)ADDR_4510_3,2,2,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								i=MRR(i+1,2);
								addr.sin_port = i;//端口号:倒序
							}
							else
							{
								i=1024;
								i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
								addr.sin_port = i;//端口号:倒序
							}
						}
					#endif
					#if MainProtocol==CSG
					
//						if(UARTCtrl->LinkCount<2)
//						{//主IP
//							MR((u32)&addr->addr[0],ADDR_AFN04F3,4);
//							MR((u32)&addr->port,ADDR_AFN04F3+4,2);
//						}
//						else
//						{//备用IP
//							MR((u32)&addr->addr[0],ADDR_AFN04F3+6,4);
//							MR((u32)&addr->port,ADDR_AFN04F3+6+4,2);
//						}
					
					#endif
						
						i=ms->link_connect(UARTCtrl->TCPSocket,(struct sockaddr*)&addr,sizeof(struct sockaddr_in));
#if ((DEBUG==1)&&(DEBUG_ETH==1))
		ms->link_printf("UARTCtrl->LinkTask=%d\n",UARTCtrl->LinkTask,0,0);
		ms->link_printf("UARTCtrl->LinkSubTask=%d\n",UARTCtrl->LinkSubTask,0,0);
		ms->link_printf("UARTCtrl->PORT=%d\n",UARTCtrl->PORT,0,0);
		ms->link_printf("eth_ms->link_connect_return=%d\n",i,0,0);
#endif
						if(i!=0)
						{//调用成功时返回0，失败时返回-1
							i=ms->link_errno();
							
#if ((DEBUG==1)&&(DEBUG_ETH==1))
		ms->link_printf("eth_ms->link_errno=%d\n",i,0,0);
#endif
							if(i==EINPROGRESS)
							{//还正在连接
								p16timer[0]=1000/10;
								WarningOccur(ENETPORT,(u8 *)"以太网正在连接主站");//告警发生,入口告警代码和告警字符
								return;
							}
							else if(i==EALREADY)
							{//
								p16timer[0]=1000/10;
								WarningOccur(ENETPORT,(u8 *)"以太网正在连接主站");//告警发生,入口告警代码和告警字符
								return;
							}
							else if(i==EISCONN)
							{
								p16timer[0]=0;//连接超时定时;Net_Config_TCP.h中重试定义#define TCP_MAX_RETRY 5,#define TCP_RETRY_TOUT 4;5*4=20秒
								UARTCtrl->LinkSubTask=0;//链接子任务
								UARTCtrl->LinkTask=100;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
								return;
							}
							UARTCtrl->LinkCount++;//连接计数+1
							if(UARTCtrl->LinkCount>=3)
							{
								UARTCtrl->LinkCount=0;
							}
							UARTCtrl->LinkTask=0;
							return;
						}
						WarningCancel(ENETPORT);//告警取消,入口告警代码
						p16timer[0]=0;//连接超时定时;Net_Config_TCP.h中重试定义#define TCP_MAX_RETRY 5,#define TCP_RETRY_TOUT 4;5*4=20秒
						UARTCtrl->LinkSubTask=0;//链接子任务
						UARTCtrl->LinkTask=100;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					return;
				default:
					UARTCtrl->LinkSubTask=0;//链接子任务
					return;
			}
			//return;
		case 100://连接ok
			break;
		case 101://登录ok
			Pin_OutL(PIN_ENET_LINK_LED);//引脚输出低,入口引脚使用名
			break;
		case 102://发退出登录
			break;
		case 103://退出登录
			if(Comm_Ram->POWER==3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
			{//电网有电则重新登录,电网掉电则保持
				UARTCtrl->LinkTask=3;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;
		case 104://关机
			p16timer[0]=2000/10;//关机延时2s(与GPRS模块相同时间)
			return;
		default:
			UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			return;
	}

//连接ok,登录ok
	if(Terminal_Ram->ENETCheck_S_Timer==0)//4 以太网IP冲突检查和租赁更新秒定时器
	{
		//经实测暂停os到允许os需24us
		Terminal_Ram->ENETCheck_S_Timer=2;
//	#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
//		Disable_os();//暂停os
//		while (inpw(REG_EMAC0_MIIDA) & 0x20000)// wait busy flag clear
//		{//MDC正忙
//		}
//		sourMACMIIDR=inpw(REG_EMAC0_MIID);//原值保护
//		i=Read_ETH_PHYReg(PHYAddr_IP101,1);
//		outpw(REG_EMAC0_MIID, sourMACMIIDR);//原值恢复
//		Enable_os();//允许os
//	#else
//		Disable_os();//暂停os
//		while (inpw(REG_EMAC1_MIIDA) & 0x20000)// wait busy flag clear
//		{//MDC正忙
//		}
//		sourMACMIIDR=inpw(REG_EMAC1_MIID);//原值保护
//		i=Read_ETH_PHYReg(PHYAddr_LAN8720,1);
//		outpw(REG_EMAC1_MIID, sourMACMIIDR);//原值恢复
//		Enable_os();//允许os
//	#endif

