gdgly/NUC97X_JS/STM32F4xx/MS/Ethernet-NUC97x-linux.c
/*
		#if RJ45SELECT!=1//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
				i=ms->link_system("/sbin/ifconfig  eth0 | grep RUNNING");
				//i=Read_ETH_PHYReg(PHYAddr_IP101,2);
				//if(i!=0x0243)//IP101GR
		#else
				i=ms->link_system("/sbin/ifconfig  eth1 | grep RUNNING");
		#endif
		if(i!=0)
		//if((i&(1<<2))==0)//bit2 link is up,bit5 auto-negotiate process completed
		{//RJ45拨出
			UARTCtrl->LinkTask=0;
			return;
		}
*/
		i=0;
	#if RJ45SELECT==0//以太网RJ45通道选择:0=eth0(IP101),1=eth1(LAN8720),2=eth0和eth1二个独立口,eth0用于以太网RJ45通道
		fd=ms->link_open("/sys/class/net/eth0/carrier",O_RDONLY);
	#elif RJ45SELECT==1
		fd=ms->link_open("/sys/class/net/eth1/carrier",O_RDONLY);
	#elif RJ45SELECT==2
		fd=ms->link_open("/sys/class/net/eth0/carrier",O_RDONLY);
	#endif
		if(fd>=0)
		{
			ms->link_lseek(fd,0,SEEK_SET);
			ms->link_read(fd,&i,1);//以太网插入为'1'，没插入为'0'
		}
		ms->link_close(fd);
//		#warning "i='1';"
//			i='1';
		if(i!='1')
		{
			UARTCtrl->LinkTask=0;
			return;
		}
	#if MainProtocol==376
		i=MRR(ADDR_AFN04F7+64,1);
		if(i==0x0)
		{//固定IP连接
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				return;
			}
		}
	#endif
	#if MainProtocol==698
		//IP配置方式enum{DHCP（0），静态（1），PPPoE（2）}
		i=MRR(ADDR_4510_4+3,1);
		if(i==1)
		{//静态（1）
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				return;
			}
		}	
	#endif
	#if MainProtocol==CSG
		i=0;//i=MRR(ADDR_AFN04F7+64,1);
		if(i==0x0)
		{//固定IP连接
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				return;
			}
		}
	#endif
	}

	switch(UARTCtrl->Task)
	{
		case 0://接收
			p16=(u16*)Get_ADDR_UARTn(ENETPORT);//得到UART缓冲首地址
			LEN_UARTnTx=Get_LEN_UARTnIntRx(ENETPORT);//得到UART中断接收缓冲长度
			LEN_UARTnTx-=10;
			p0=p16[0];
			if(p0>=LEN_UARTnTx)
			{
				p0=0;
			}
			x=LEN_UARTnTx-p0;//可接收长度
			if((UARTCtrl->TCPUDP&0x80)==0x0)
			{//TCP
				i=ms->link_recv(UARTCtrl->TCPSocket,(void *)((u32)p16+10+p0),x,MSG_DONTWAIT);
			}
			else
			{//UDP
				i=ms->link_recv(UARTCtrl->UDPSocket,(void *)((u32)p16+10+p0),x,MSG_DONTWAIT);
			}
			#if ((DEBUG==1)&&(DEBUG_ETH==1))
			ms->link_printf("tcplink_recv_socket=%d\n",UARTCtrl->TCPSocket,0,0);
			ms->link_printf("link_recv_return=%d\n",i,0,0);
			errno=ms->link_errno();
			ms->link_printf("link_recv_error=%d\n",errno,0,0);
			#endif
			if(i==0)
			{//socket断开，需要重新连接
				ms->link_close(UARTCtrl->TCPSocket);
				UARTCtrl->TCPSocket=0;
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			  return;
			}
			else if(i<0)//非阻塞模式下的接收
			{
				errno=ms->link_errno();
			  if((errno!=EINTR)&&(errno!=EAGAIN))
				{
				  ms->link_close(UARTCtrl->TCPSocket);
				  UARTCtrl->TCPSocket=0;
				  UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				}else if(errno==ECONNRESET)
				{
					ms->link_close(UARTCtrl->TCPSocket);
				  UARTCtrl->TCPSocket=0;
				  UARTCtrl->LinkTask=0;//á′?óè???0-993?ê?1y3ì,100=?¨á￠á??ó,101=μ???,102=·￠í?3?μ???,103=í?3?μ???,104=1??ú
				}
				return;
			}
			if(i<=LEN_UARTnTx)
			{
				p0+=i;
				if(p0>=LEN_UARTnTx)
				{
					p0=0;
				}
				p16[0]=p0;
			}
			
			//在线控制
			if(UARTCtrl->LinkCtrl==0)//连接控制0=不连接,1=连接
			{
				if(UARTCtrl->LinkTask==101)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				{
					UARTCtrl->LinkTask=102;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					UARTCtrl->HeartberatCount=0;//心跳发出计数,收到确认帧清0
					Terminal_Ram->ENETHeartBeat_S_Timer=0;//2 以太网心跳秒定时器
					return;
				}
			}
			break;
		case 2://等待单帧数据发送
		#if MainProtocol==376
		case 5://等待多帧数据发送
			#if (USER/100)==11//吉林系
				USER11xx_TxAddr(ENETPORT);//吉林系发送帧终端地址2字节长度变为4字节,并重新计算帧校验和,需发送的帧字节数+2
			#endif
			UARTCtrl->TxCount=0;
			p16timer[0]=30000/10;//30秒,等待发送数据给主站时间超时定时
			UARTCtrl->Task++;
		#endif
		#if MainProtocol==698
			LEN_UARTnTx=Get_LEN_UARTnTx(ENETPORT);
			p8tx=(char *)Get_ADDR_UARTnTx(ENETPORT);
			LEN_ADDR=p8tx[4];//取地址字节数
			LEN_ADDR&=0x0f;
			LEN_ADDR++;
			LEN_ADDR+=2;
			LEN_TAPDU=p8tx[1]+(p8tx[2]<<8);//除起始字符和结束字符之外的帧字节数
			LEN_TAPDU-=3+LEN_ADDR+2+2;
			if(LEN_TAPDU<=LENmax_TxAPDU)//链路层分帧发送，每帧最大APDU字节数
			{
			#if LOG_698==1//0=没,1=有
				LOG(698,1,ENETPORT,(u8 *)Get_ADDR_UARTnTx(ENETPORT),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
			#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
				LOGRS232(698,1,ENETPORT,(u8 *)Get_ADDR_UARTnTx(ENETPORT),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
				UARTCtrl->TxCount=0;
				p16timer[0]=30000/10;//30秒,等待发送数据给主站时间超时定时
				UARTCtrl->Task++;
			}
			else
			{
				p8tx=(char *)Get_ADDR_UARTnTx(ENETPORT);
				MW((u32)p8tx,(u32)p8tx+LEN_UARTnTx,UARTCtrl->TxByte);
				UARTCtrl->TxAPDUSEQ=0;//链路层分帧序号计数0-4095
				UARTCtrl->TxAPDUByte=0;//链路层分帧已发送APDU字节数
				UARTCtrl->Task=5;//5=等待链路层分帧数据发送
			}
		#endif
			break;
	#if MainProtocol==698
		case 5://等待多帧数据发送
			LEN_UARTnTx=Get_LEN_UARTnTx(ENETPORT);
			p8tx=(char *)Get_ADDR_UARTnTx(ENETPORT);
			LEN_ADDR=p8tx[4];//取地址字节数
			LEN_ADDR&=0x0f;
			LEN_ADDR++;
			LEN_ADDR+=2;
			LEN_TAPDU=p8tx[LEN_UARTnTx+1]+(p8tx[LEN_UARTnTx+2]<<8);//除起始字符和结束字符之外的帧字节数
			LEN_TAPDU-=3+LEN_ADDR+2+2;//长度域L和控制域C=3byte,帧头校验=2byte,帧校验=2byte
			MR((u32)p8tx,(u32)p8tx+LEN_UARTnTx,4+LEN_ADDR+2);
			p8tx[3]|=(1<<5);//分帧标志位
			LEN_Tx=4+LEN_ADDR+2;
			i=UARTCtrl->TxAPDUByte;
			if(i>=LEN_TAPDU)
			{
				UARTCtrl->RxByte=0;//rx计数=0
				UARTCtrl->Task=0;//0=接收
				return;
			}
			LEN_TxAPDU=LEN_TAPDU-i;
		//分帧格式域定义
		//bit0~bit11：表示分帧传输过程的帧序号，取值范围0~4095，循环使用；
		//bit12~bit13：保留；
		//bit15=0，bit14=0：表示分帧传输数据起始帧；
		//bit15=1，bit14=0：表示分帧传输确认帧（确认帧不包含APDU片段域）；
		//bit15=0，bit14=1：表示分帧传输最后帧；
		//bit15=1，bit14=1：表示分帧传输中间帧。
			x=UARTCtrl->TxAPDUSEQ;//链路层分帧序号计数0-4095
			UARTCtrl->TxAPDUSEQ++;//链路层分帧序号计数0-4095
			x&=0x7ff;
			if(UARTCtrl->TxAPDUByte==0)
			{//第1帧
				LEN_TxAPDU=LENmax_TxAPDU;
			}
			else
			{
				if(LEN_TxAPDU>LENmax_TxAPDU)//链路层分帧发送，每帧最大APDU字节数
				{//中间帧
					x|=0xC000;
					LEN_TxAPDU=LENmax_TxAPDU;
				}
				else
				{//最后帧
					x|=0x4000;
				}
			}
			p8tx[LEN_Tx]=x;
			p8tx[LEN_Tx+1]=x>>8;
			LEN_Tx+=2;
			MR((u32)p8tx+LEN_Tx,(u32)p8tx+LEN_UARTnTx+4+LEN_ADDR+2+UARTCtrl->TxAPDUByte,LEN_TxAPDU);
			UARTCtrl->TxAPDUByte+=LEN_TxAPDU;
			LEN_Tx+=LEN_TxAPDU;
			LEN_Tx+=2+1;
			UARTCtrl->TxByte=LEN_Tx;
			LEN_Tx-=2;
			p8tx[1]=LEN_Tx;
			p8tx[2]=LEN_Tx>>8;
			Uart_698_HCSFCS((u8*)p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
		 #if LOG_68==1//0=没,1=有
			LOG(698,1,ENETPORT,(u8 *)Get_ADDR_UARTnTx(ENETPORT),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		 #endif
		 #if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
			LOGRS232(698,1,ENETPORT,(u8 *)Get_ADDR_UARTnTx(ENETPORT),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		 #endif
			UARTCtrl->TxCount=0;
			p16timer[0]=30000/10;//30秒,等待发送数据给主站时间超时定时
			UARTCtrl->Task++;
			break;
	#endif
		case 3://发送单帧数据正在发送
		case 6://多帧数据正在发送
			if(UARTCtrl->TxByte)
			{
				if((UARTCtrl->TCPUDP&0x80)==0x0)
				{//TCP
					x=2048;
					if(x>UARTCtrl->TxByte)
					{
						x=UARTCtrl->TxByte;
					}
					p8s=(u8*)Get_ADDR_UARTnTx(ENETPORT);
					p8s+=UARTCtrl->TxCount;
					i=ms->link_send(UARTCtrl->TCPSocket, (void *)p8s,x, MSG_DONTWAIT);
		#if ((DEBUG==1)&&(DEBUG_ETH==1))
					ms->link_printf("tcplink_send_socket=%d\n",UARTCtrl->TCPSocket,0,0);
					ms->link_printf("link_send_return=%d\n",i,0,0);
					errno=ms->link_errno();
					ms->link_printf("link_send_error=%d\n",errno,0,0);
					if(errno==ENOTSOCK)
					{
						ms->link_sleep(5);
					}
		#endif

