gdgly/NUC97X_JS/STM32F4xx/MS/Ethernet-NUC97x-linux.c
					if(i==x)
					{
						UARTCtrl->TxByte-=x;
						UARTCtrl->TxCount+=x;
						Terminal_Ram->ENETLED_MS_Timer=50/10;//14 以太网接收发送LED指示MS定时器,每10MS减1定时器
					}
					else if(i>0)
					{
						UARTCtrl->TxByte-=i;
						UARTCtrl->TxCount+=i;
						Terminal_Ram->ENETLED_MS_Timer=50/10;//14 以太网接收发送LED指示MS定时器,每10MS减1定时器
					}
					else
					{
					  errno=ms->link_errno();
						if((errno==EINTR)||(errno==EAGAIN))
						{
							//不做任何处理
						}
						else
						{
							if(p16timer[0]==0)//60秒,等待发送数据给主站时间超时定时
						  {
							  UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
						  }
						}
					}
				}
				else
				{//UDP
					x=1440;
					if(x>UARTCtrl->TxByte)
					{
						x=UARTCtrl->TxByte;
					}
					p8s=(u8*)Get_ADDR_UARTnTx(ENETPORT);
					p8s+=UARTCtrl->TxCount;
					UARTCtrl->TxByte-=x;
					UARTCtrl->TxCount+=x;
				#if MainProtocol==376
					MR((u32)&addr.sin_addr.s_addr,ADDR_AFN04F3,4);
					i=MRR(ADDR_AFN04F3+4,2);
					i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
					addr.sin_port = i;//端口号:倒序	
				#endif
				#if MainProtocol==698
					i=(u32)Get_Element((u8*)ADDR_4510_3,1,1,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
					if(i)
					{
						MR((u32)&addr.sin_addr.s_addr,i+2,4);
					}
					else
					{
						MWR(192+(168<<8)+(1<<16)+(3<<24),(u32)&addr.sin_addr.s_addr,4);
					}
					i=(u32)Get_Element((u8*)ADDR_4510_3,1,2,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
					if(i)
					{
						i=MRR(i+1,2);
						addr.sin_port = i;//端口号:倒序	
					}
					else
					{
						i=1024;
						i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
						addr.sin_port = i;//端口号:倒序	
					}
				#endif
				#if MainProtocol==CSG
				/*
					MR((u32)&addr->addr[0],ADDR_AFN04F3,4);
					MR((u32)&addr->port,ADDR_AFN04F3+4,2);
				*/
				#endif
					ms->link_sendto(UARTCtrl->UDPSocket, (void *)p8s,x, MSG_DONTWAIT,(struct sockaddr*)&addr,sizeof(struct sockaddr_in));
					Terminal_Ram->ENETLED_MS_Timer=50/10;//14 以太网接收发送LED指示MS定时器,每10MS减1定时器
				}
			}
			else
			{
				if(UARTCtrl->Task==3)
				{
					UARTCtrl->Task=7;//7=等待发送器空转为接收
				}
				else
				{
				#if MainProtocol==376
					UARTCtrl->Task=4;//4=多帧数据续接收完成
				#else
					UARTCtrl->Task=7;//7=等待发送器空转为接收
				#endif
				}
			}
			break;
	}
 #endif//#if (IC_LAN8720|IC_IP101)==0
}


#endif













